In [1]:
!pip install mysql.connector.python

Requirement already satisfied: mysql.connector.python in d:\programdata\anaconda3\lib\site-packages (9.4.0)

In [2]:
import mysql.connector
db = mysql.connector.connect(
    host = '127.0.0.1',
    user = 'root',
    password = '0100',
    database = 'sakila'
)
cursor = db.cursor()

In [3]:
cursor.reset()
cursor.execute('show tables')

tables = cursor.fetchall()
for table in tables:
    print(table)

('actor',)
('actor_info',)
('address',)
('category',)
('city',)
('country',)
('customer',)
('customer_list',)
('film',)
('film_actor',)
('film_category',)
('film_list',)
('film_text',)
('inventory',)
('language',)
('nicer_but_slower_film_list',)
('payment',)
('rental',)
('sales_by_film_category',)
('sales_by_store',)
('staff',)
('staff_list',)
('store',)

In [4]:
cursor.execute('CREATE DATABASE IF NOT EXISTS debi_3')

In [5]:
cursor.execute('SHOW DATABASES')
print(cursor.fetchall())

[('debi_3',), ('information_schema',), ('mysql',), ('performance_schema',), ('sakila',), ('sys',), ('world',)]

In [6]:
cursor.execute('use debi_3')

In [7]:
cursor.execute('CREATE TABLE IF NOT EXISTS Employee (id INT, name VARCHAR(255), age INT)')
cursor.execute('show tables')
print(cursor.fetchall())

[('employee',)]

In [8]:
scheme = cursor.fetchall()
for table in scheme:
    print(table)

In [9]:
cursor.execute('DROP TABLE IF EXISTS Employee')
cursor.execute('show tables')
tables = cursor.fetchall()
for table in tables:
    print(table)

In [10]:
cursor.execute("CREATE TABLE IF NOT EXISTS Employee (id INT, name VARCHAR(255), age INT)")

In [11]:

cursor.execute("DESCRIBE Employee")
schema = cursor.fetchall()
for column in schema:
    print(column)

('id', 'int', 'YES', '', None, '')
('name', 'varchar(255)', 'YES', '', None, '')
('age', 'int', 'YES', '', None, '')

In [12]:
cursor.execute('ALTER TABLE Employee ADD COLUMN salary INT NOT NULL')

In [13]:
cursor.execute('ALTER TABLE Employee MODIFY COLUMN salary INT')

In [14]:
cursor.execute("INSERT INTO Employee (id, name, age, salary) VALUES (1, 'John Doe', 30, 5000)")

cursor.execute("SELECT * FROM Employee")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'John Doe', 30, 5000)

In [15]:
data = [
    (2, 'Jane Smith', 25),
    (3, 'Alice Johnson', 28),
    (4, 'Bob Brown', 35)
]

cursor.executemany("INSERT INTO Employee (id, name, age) VALUES (%s, %s, %s)", data)

cursor.execute("SELECT * FROM Employee")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'John Doe', 30, 5000)
(2, 'Jane Smith', 25, None)
(3, 'Alice Johnson', 28, None)
(4, 'Bob Brown', 35, None)

In [16]:
cursor.execute('TRUNCATE TABLE Employee')

In [17]:
cursor.execute('select * from Employee')
rows = cursor.fetchall()
for row in rows:
    print(row)

In [18]:
cursor.execute("UPDATE Employee SET salary = 3000 WHERE age < 30")

cursor.execute('select * from Employee')
rows = cursor.fetchall()
for row in rows:
    print(row)

In [19]:
cursor.execute('DELETE FROM Employee WHERE id = 1')
 
cursor.execute('select * from Employee')
rows = cursor.fetchall()
for row in rows:
    print(row)

In [20]:
cursor.execute("UPDATE Employee SET salary = 5000 WHERE salary IS NULL")

cursor.execute("SELECT * FROM Employee")
rows = cursor.fetchall()
for row in rows:
    print(row)